Tekla Open API Reference for Tekla Structures 2025
TemplateInfo Constructor
Overload List
Name | Description
TemplateInfo()
 Creates a new template info instance.
TemplateInfo(String)
 Creates a new template info instance with the given template file name.
Top
See Also
Reference
TemplateInfo Class
Tekla.Structures.Drawing Namespace